[
{
"description": "MyGameList",
"format_version": "10"
},
{
"flags": "",
"graphic": "images/darksouls.jpg",
"graphic_alt": "-",
"helptext": "Dark Souls: Prepare to Die Edition is an action role-playing open world video game. Gameplay consists of dungeon crawling in almost relentlessly hostile environments. The challenging nature of the game provides a foundation of achievement and reward, reinforced by penalties upon player death.",
"name": "Dark Souls",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/witcher3.png",
"graphic_alt": "-",
"helptext": "The climactic third game in the fantasy RPG series, The Witcher 3: Wild Hunt is a unique combination of a non-linear story and an open world -- a character-driven, non-linear story experience focused on player choice, tactical combat and a rich, living environment.",
"name": "Witcher 3: Wild Hunt",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/forhonor.jpg",
"graphic_alt": "-",
"helptext": "The Art of Battle, For Honor’s innovative control system, puts you in total control of your Heroes. Each has distinct skills and uses unique melee weapons. Combat is designed to deliver the feeling of true dueling without sacrificing accessibility and simplicity.",
"name": "For Honor",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/ori.jpg",
"graphic_alt": "-",
"helptext": "From the creators of the multi award winning Ori and the Blind Forest comes the highly-anticipated sequel: Ori and the Will of the Wisps. Embark on an all new adventure to discover the mysteries beyond the forest of Nibel, uncover the hidden truths of those lost, and unravel Ori’s true destiny. ",
"name": "Ori and the Will of the Wisps",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/mordhau.jpg",
"graphic_alt": "-",
"helptext": "Mordhau is a multiplayer medieval fighting game where fights range from duels all the way to large, open battles of up to 64 players with horses, siege engines, and castles to be stormed. It features a skill-based free-flowing combat system that is easy to learn, but hard to master.",
"name": "Mordhau",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/warcraft3.png",
"graphic_alt": "-",
"helptext": "Warcraft III contains four playable races: Humans and Orcs, which had previously appeared in Warcraft: Orcs & Humans and Warcraft II: Tides of Darkness, and the Night Elves and Undead, which are new to the Warcraft mythos. Warcraft III's single-player campaign is laid out similarly to that of StarCraft , being told through all four of the game's races in a progressive manner.",
"name": "Warcraft 3",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/tww.png",
"graphic_alt": "-",
"helptext": "The second in a trilogy and sequel to the award-winning Total War: WARHAMMER, Total War: WARHAMMER II brings players a breathtaking new narrative campaign, set across the vast continents of Lustria, Ulthuan, Naggaroth and the Southlands. The Great Vortex Campaign builds pace to culminate in a definitive and climactic endgame, an experience unlike any other Total War title to date.",
"name": "Total War: WARHAMMER II",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/gris.png",
"graphic_alt": "-",
"helptext": "GRIS is a serene and evocative experience, free of danger, frustration or death. Players will explore a meticulously designed world brought to life with delicate art, detailed animation, and an elegant original score. Through the game light puzzles, platforming sequences, and optional skill-based challenges will reveal themselves as more of Gris’s world becomes accessible.",
"name": "Gris",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/journey.jpg",
"graphic_alt": "-",
"helptext": "An exotic adventure with a more serious tone, Journey presents TGCs unique vision of an online adventure experience. Awakening in an unknown world, the player walks, glides, and flies through a vast and awe-inspiring landscape, while discovering the history of an ancient, mysterious civilization along the way.",
"name": "Journey",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/twocrowns.jpg",
"graphic_alt": "-",
"helptext": "In the award-winning Kingdom series, players took on the role of a monarch struggling to build their kingdom up from nothing. Hundreds of thousands of players across the world explored, recruited loyal subjects, and defended nightly against the persistent threat of the Greed – but they did so in isolation, and as with all things in Kingdom, nothing lasts… until now.",
"name": "Kingdom: Two Crowns",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/coh2.png",
"graphic_alt": "-",
"helptext": "Company of Heroes 2 is a real-time strategy game developed by Relic Entertainment and published by Sega for the Microsoft Windows platform. The game features the Soviet Red Army as a new faction and takes the player to various stages of the Eastern Front campaign, from Operation Barbarossa to the Battle of Berlin.",
"name": "Company of Heroes 2",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/magicka.png",
"graphic_alt": "-",
"helptext": "Magicka is a satirical action-adventure game set in a rich fantasy world based on Norse mythology. The player assumes the role of a wizard from a sacred order tasked with stopping an evil sorcerer who has thrown the world into turmoil, his foul creations besieging the forces of good. Players will be able to combine elements to cast spells, wreaking havoc and devastation on the minions of darkness.",
"name": "Magicka",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/ff12.png",
"graphic_alt": "-",
"helptext": "Final Fantasy XII is set in Ivalice, a fantasy world which also served as a setting for Final Fantasy Tactics. The game differs from its predecessors in several core gameplay-related aspects. The game world is composed of vast areas with visibly walking enemies. There are no separate battle screens in the game; combat takes place in the same environment as exploration.",
"name": "Final Fantasy XII",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/dontstarve.png",
"graphic_alt": "-",
"helptext": "Don't Starve is a 2013 open world survival video game developed by Klei Entertainment. The game's goal is surviving for the longest time, while avoiding starvation, insanity, and hostile enemies. The player can collect and craft a variety of tools and items as well as build various structures to aid in surviving. An 1adventure mode is also included in the game, which presents increasingly difficult levels for the player to complete.",
"name": "Don't Starve",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/re2.jpg",
"graphic_alt": "-",
"helptext": "In Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City that transformed its population into deadly zombies. Both Leon and Claire have their own separate playable campaigns, allowing players to see the story from both characters’ perspectives.",
"name": "Resident Evil 2",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/vermintide.jpg",
"graphic_alt": "-",
"helptext": "Warhammer: Vermintide 2 is the sequel to the critically acclaimed Vermintide. The time has arrived to revisit the fierce first-person co-op slaughter-fest featuring visceral and ground breaking melee action, set in the apocalyptic End Times of the war-ravaged Warhammer Fantasy Battles world.",
"name": "Warhammer: Vermintide 2",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/dyinglight.png",
"graphic_alt": "-",
"helptext": "Dying Light is a 1st-person, action survival horror game set in a vast and dangerous open world. During the day, players traverse an expansive urban environment overrun by a vicious outbreak, scavenging the world for supplies and crafting weapons to defend against the growing infected population.",
"name": "Dying Light",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/civ6.jpg",
"graphic_alt": "-",
"helptext": "Sid Meier's Civilization VI is an entry in the long-running Civilization series of strategy games. It retains most of the features of Civilization V (with expansions), with the World Congress being the only significant omission. On top of this, the game adds a new victory type (religious); separates technological and cultural development into separate trees, with advances being divided between technologies and civics; unstacks cities, with development via specialised districts; makes happiness more local, and introduces housing as a restriction on city growth; reforms the city-state system to give a unique bonus to every city-state; overhauls the great people system to give unique powers to each great person; along with a host of other changes.",
"name": "Sid Meier's Civilization VI",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/xcom.png",
"graphic_alt": "-",
"helptext": "XCOM 2 is the sequel to the award-winning strategy game, XCOM: Enemy Unknown. Twenty years have passed since humanity lost the war against the alien invaders and a new world order now exists on Earth. After years of lurking in the shadows, XCOM forces must rise and eliminate the alien occupation.",
"name": "XCOM 2",
"req1": "None",
"req2": "None"
},
{
"flags": "",
"graphic": "images/mordor.jpg",
"graphic_alt": "-",
"helptext": "You are Talion, a Ranger of the Black Gate, keeping watch over Mordor which has remained undisturbed for ages. In the blink of an eye, everything is taken from you - your friends, your family, and even your own life. Resurrected by a vengeful spirit, you must now embark on a relentless vendetta against those who have wronged you. Fight through Mordor and uncover the truth of the spirit that compels you, discover the origins of the Rings of Power, build your legend and ultimately confront the evil of Sauron in this new chronicle in Middle-earth.",
"name": "Middle-earth: Shadow of Mordor",
"req1": "None",
"req2": "None"
}
]